maven/OpenIDM-provisioning/OpenIDM-provisioning-service/src/test/resources/ResourceConfiguration.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:rep="http://openidm.forgerock.com/xml/ns/public/repository/repository-1.wsdl" xmlns:com="http://openidm.forgerock.com/xml/ns/public/common/common-1.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <rep:addObject>
            <objectContainer>
                <com:object oid="ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2" xsi:type="com:ResourceType" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
                    <com:name>Localhost OpenDJ</com:name>
                    <com:type>http://openidm.forgerock.com/xml/ns/public/resource/idconnector/resourceaccessconfiguration-1.xsd</com:type>
                    <com:namespace>http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2</com:namespace>
                    <!--com:namespace>http://openidm.forgerock.com/schema/resources/instances/ldap/localhostOpenDS</com:namespace-->
                    <com:resourceAccessConfigurationRef type="com:ResourceAccessConfigurationType" oid="acf6bd6d-d3ee-4756-bf94-22c2f5168f63"/>
                    <com:schema>
                        <schema xmlns:xns0="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2" xmlns:xns1="http://openidm.forgerock.com/xml/ns/public/resource/idconnector/resource-schema-1.xsd" elementFormDefault="qualified" targetNamespace="http://openidm.forgerock.com/xml/ns/public/resource/instances/ef2bc95b-76e0-48e2-86d6-3d4f02d3e1a2" xmlns="http://www.w3.org/2001/XMLSchema">
                            <import namespace="http://openidm.forgerock.com/xml/ns/public/resource/idconnector/resource-schema-1.xsd"/>
                            <import namespace="http://openidm.forgerock.com/xml/ns/public/common/common-1.xsd"/>
                            <import namespace="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                            <complexType name="__ACCOUNT__">
                                <annotation>
                                    <appinfo>
                                        <identifier ref="xns1:uid" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <secondaryIdentifier ref="xns1:name" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <compositeIdentifier ref="xns0:sn" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <displayName ref="xns0:description" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <descriptionAttribute ref="xns0:description" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <nativeObjectClass ref="__ACCOUNT__" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <accountType default="true" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                    </appinfo>
                                </annotation>
                                <complexContent>
                                    <extension xmlns:null="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd" base="null:ResourceObjectClass">
                                        <sequence>
                                            <element minOccurs="0" name="description" type="string"/>
                                            <element name="sn" type="string">
                                                <annotation>
                                                    <appinfo>
                                                        <attributeFlag xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">NOT_UPDATEABLE</attributeFlag>
                                                        <nativeAttributeName xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">sn</nativeAttributeName>
                                                    </appinfo>
                                                </annotation>
                                            </element>
                                            <element ref="xns1:password">
                                                <annotation>
                                                    <appinfo>
                                                        <attributeFlag xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">PASSWORD</attributeFlag>
                                                        <classifiedAttribute xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">
                                                            <encryption>HASH</encryption>
                                                            <classificationLevel>password</classificationLevel>
                                                        </classifiedAttribute>
                                                        <nativeAttributeName xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">__PASSWORD__</nativeAttributeName>
                                                    </appinfo>
                                                </annotation>
                                            </element>
                                            <element maxOccurs="unbounded" minOccurs="0" name="groups" type="string"/>
                                            <element ref="xns1:uid">
                                                <annotation>
                                                    <appinfo>
                                                        <attributeFlag xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">NOT_UPDATEABLE</attributeFlag>
                                                        <nativeAttributeName xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">__UID__</nativeAttributeName>
                                                    </appinfo>
                                                </annotation>
                                            </element>
                                            <element minOccurs="0" name="custom" type="string">
                                                <annotation>
                                                    <appinfo>
                                                        <attributeFlag xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">IGNORE_ATTRIBUTE</attributeFlag>
                                                        <help xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">This attribute part of the SchemaHandling</help>
                                                        <nativeAttributeName xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">custom</nativeAttributeName>
                                                    </appinfo>
                                                </annotation>
                                            </element>
                                            <element ref="xns1:name"/>
                                            <element minOccurs="0" name="fullName" type="string"/>
                                            <element minOccurs="0" name="givenName" type="string"/>
                                        </sequence>
                                    </extension>
                                </complexContent>
                            </complexType>
                            <complexType name="__GROUP__">
                                <annotation>
                                    <appinfo>
                                        <identifier ref="xns1:uid" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <secondaryIdentifier ref="xns1:name" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <displayName ref="xns0:description" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <descriptionAttribute ref="xns0:description" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <nativeObjectClass ref="__GROUP__" xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                        <container xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd"/>
                                    </appinfo>
                                </annotation>
                                <complexContent>
                                    <extension xmlns:null="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd" base="null:ResourceObjectClass">
                                        <sequence>
                                            <element minOccurs="0" name="description" type="string"/>
                                            <element ref="xns1:uid">
                                                <annotation>
                                                    <appinfo>
                                                        <attributeFlag xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">NOT_UPDATEABLE</attributeFlag>
                                                        <nativeAttributeName xmlns="http://openidm.forgerock.com/xml/ns/public/resource/resource-schema-1.xsd">__UID__</nativeAttributeName>
                                                    </appinfo>
                                                </annotation>
                                            </element>
                                            <element ref="xns1:name"/>
                                        </sequence>
                                    </extension>
                                </complexContent>
                            </complexType>
                        </schema>
                    </com:schema>
                    <com:schemaHandling>
                        <com:accountType objectClass="ns99:AccountObjectClass" default="true">
                            <com:name>Default Account</com:name>
                        </com:accountType>
                    </com:schemaHandling>
                    <configuration xmlns="http://openidm.forgerock.com/xml/ns/public/common/common-1.xsd">
                        <icci:ConnectorConfiguration xmlns:icci="http://openidm.forgerock.com/xml/ns/public/resource/idconnector/configuration-1.xsd">
                            <icci:ConnectorRef connectorName="org.identityconnectors.ldap.LdapConnector" bundleVersion="1.0.5531" bundleName="org.identityconnectors.ldap">
                                <icci:ConnectorHostRef>/configuration/connectorHost[@oid='1234']/configuration</icci:ConnectorHostRef>
                            </icci:ConnectorRef>
                            <icci:BundleProperties>
                                <iccldap:port xmlns:iccldap="http://openidm.forgerock.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531">1389</iccldap:port>
                                <iccldap:host xmlns:iccldap="http://openidm.forgerock.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531">localhost</iccldap:host>
                                <iccldap:baseContexts xmlns:iccldap="http://openidm.forgerock.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531">dc=example,dc=com</iccldap:baseContexts>
                                <iccldap:principal xmlns:iccldap="http://openidm.forgerock.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531">cn=directory manager</iccldap:principal>
                                <iccldap:credentials xmlns:iccldap="http://openidm.forgerock.com/xml/ns/resource/idconnector/bundle/org.identityconnectors.ldap/org.identityconnectors.ldap.LdapConnector/1.0.5531">qwe123</iccldap:credentials>
                            </icci:BundleProperties>
                            <icci:PoolConfigOption maxWait="0" maxObjects="12" maxIdle="6000" minIdle="98745" minEvictTimeMillis="0"/>
                            <icci:OperationTimeouts>
                                <icci:OperationTimeout timeout="50000" name="create"/>
                                <icci:OperationTimeout timeout="50000" name="update"/>
                                <icci:OperationTimeout timeout="50000" name="delete"/>
                                <icci:OperationTimeout timeout="50000" name="test"/>
                                <icci:OperationTimeout timeout="50000" name="scriptOnConnector"/>
                                <icci:OperationTimeout timeout="50000" name="scriptOnResource"/>
                                <icci:OperationTimeout timeout="50000" name="get"/>
                                <icci:OperationTimeout timeout="50000" name="authenticate"/>
                                <icci:OperationTimeout timeout="50000" name="search"/>
                                <icci:OperationTimeout timeout="50000" name="validate"/>
                                <icci:OperationTimeout timeout="50000" name="sync"/>
                                <icci:OperationTimeout timeout="50000" name="schema"/>
                            </icci:OperationTimeouts>
                        </icci:ConnectorConfiguration>
                    </configuration>
                </com:object>
            </objectContainer>
        </rep:addObject>
    </soapenv:Body>
</soapenv:Envelope>